Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetDisplayedEndStation(Autodesk.Revit.DB.Element,System.Double)
An internal setter for the alignment's "Displayed End Station" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetDisplayedStartStation(Autodesk.Revit.DB.Element,System.Double)
An internal setter for the alignment's "Displayed Start Station" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetDescription(Autodesk.Revit.DB.Element,System.String)
An internal setter for the alignment's "Description" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentCell.SetName(Autodesk.Revit.DB.Element,System.String)
An internal setter for the alignment's "Name" parameter.
Supports setting the member variable and touching the appropriate atom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021